In [26]:
import sqlalchemy as db
import getpass

In [27]:
user = "root"
password = getpass.getpass("Insert password: ")
connectionURI = f"mysql+pymysql://{user}:{password}@localhost/publications"

Insert password: ········

In [28]:
engine = db.create_engine(connectionURI)
print("Connected to server!")

Connected to server!

In [29]:
import pandas as pd

In [32]:
challenge1 = pd.read_sql_query("""
    SELECT 
    authors.au_id AS AUTHOR_ID,
    authors.au_lname AS LAST_NAME,
    authors.au_fname  AS FIRST_NAME, 
    titles.title AS TITLE,
    publishers.pub_name AS PUBLISHER
    
	FROM authors
    
    LEFT JOIN titleauthor ON authors.au_id = titleauthor.au_id
    LEFT JOIN titles ON titleauthor.title_id = titles.title_id
    LEFT JOIN publishers ON titles.pub_id = publishers.pub_id;

""",engine)


challenge1.head(5)

,AUTHOR_ID,LAST_NAME,FIRST_NAME,TITLE,PUBLISHER
0,172-32-1176,White,Johnson,Prolonged Data Deprivation: Four Case Studies,New Moon Books
1,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
2,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books
3,238-95-7766,Carson,Cheryl,But Is It User Friendly?,Algodata Infosystems
4,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems

In [34]:
challenge2 = pd.read_sql_query("""
  SELECT authors.au_id as AUTHOR_ID, authors.au_lname as LAST_NAME, authors.au_fname as FIRTS_NAME, 
publishers.pub_name as PUBLISHER,  COUNT(titles.title)TITLE_COUNT
		FROM authors
	LEFT JOIN titleauthor ON authors.au_id=titleauthor.au_id
	LEFT JOIN titles ON titleauthor.title_id=titles.title_id
	LEFT JOIN publishers ON titles.pub_id= publishers.pub_id
	GROUP BY AUTHOR_ID , PUBLISHER
	ORDER BY TITLE_COUNT;

""",engine)

challenge2.head(5)

     AUTHOR_ID LAST_NAME   FIRTS_NAME       PUBLISHER  TITLE_COUNT
0  724-08-9931  Stringer         Dirk            None            0
1  527-72-3246    Greene  Morningstar            None            0
2  893-72-1158  McBadden      Heather            None            0
3  341-22-1782     Smith      Meander            None            0
4  213-46-8915     Green     Marjorie  New Moon Books            1

In [38]:
challenge3 = pd.read_sql_query(""" SELECT authors.au_id as AUTHOR_ID, authors.au_lname as LAST_NAME, authors.au_fname as FIRTS_NAME, 
SUM(sales.qty) as TOTAL
		FROM authors
	LEFT JOIN titleauthor ON authors.au_id=titleauthor.au_id
	LEFT JOIN sales ON titleauthor.title_id=sales.title_id
	
	GROUP BY AUTHOR_ID 
	ORDER BY TOTAL desc
    LIMIT 3;  """,engine)

challenge3

     AUTHOR_ID LAST_NAME FIRTS_NAME  TOTAL
0  899-46-2035    Ringer       Anne  148.0
1  998-72-3567    Ringer     Albert  133.0
2  846-92-7186    Hunter     Sheryl   50.0

In [ ]:
challenge4 = pd.read_sql_query(""" SELECT authors.au_id as AUTHOR_ID, authors.au_lname as LAST_NAME, authors.au_fname as FIRTS_NAME, 
SUM(sales.qty) as TOTAL
		FROM authors
	LEFT JOIN titleauthor ON authors.au_id=titleauthor.au_id
	LEFT JOIN sales ON titleauthor.title_id=sales.title_id
	
	GROUP BY AUTHOR_ID 
	ORDER BY TOTAL desc
    LIMIT 3;  """,engine)